org/index.org
#+TITLE: Eryk Banatt
#+HTML_HEAD:  <script src="https://cdnjs.cloudflare.com/ajax/libs/jquery/1.11.3/jquery.min.js"></script>
#+HTML_HEAD: <meta charset="utf-8">
#+HTML_HEAD: <meta http-equiv="X-UA-Compatible" content="IE=edge">
#+HTML_HEAD: <meta name="viewport" content="width=device-width, initial-scale=1">
#+HTML_HEAD: <script async src="https://www.googletagmanager.com/gtag/js?id=UA-101739190-1"></script>
#+HTML_HEAD: <script>   window.dataLayer = window.dataLayer || [];  function gtag(){dataLayer.push(arguments);} gtag('js', new Date());  gtag('config', 'UA-101739190-1');</script>
#+HTML_HEAD: <script src="https://cdnjs.cloudflare.com/ajax/libs/jquery/1.11.3/jquery.min.js"></script>
#+HTML_HEAD: <script src="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/js/bootstrap.min.js"></script>
#+HTML_HEAD: <link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
#+HTML_HEAD: <link  href="./css/index.css" rel="stylesheet">


* Articles

** Recent

[[https://planetbanatt.net/articles/paocards.html][Printing Custom PAO Playing Cards]]

** Projects

[[https://planetbanatt.net/articles/lastdance.pdf][LASTDANCE: Layerwise Activation Similarity to Training Data for Assessing Non-Conforming Events (pre-preprint)]] [[https://github.com/ambisinister/LASTDANCE/blob/master/LASTDANCE_README.ipynb][(Notebook)]]

[[file:articles/ambistats.html][Making Sense of Melee: The Illusion of Objective Ranks and the Real Impact of Everything]]

[[https://planetbanatt.net/articles/itsa17.html][Auto-Rating ITG Stamina Charts with Machine Learning]]

[[https://planetbanatt.net/articles/Bracket_Stamina.pdf][Bracket Stamina: Inferring the Intent of Other Agents in a Multiplayer Kelly Coin Flip Game]]

[[file:articles/visualdistance.html][Locating Visual Jokes in Homestuck Using Rudimentary Computer Vision]]

[[file:articles/groundwork_for_projection_algorithm.html][Melee Bracket Projection Algorithm]] - [[file:articles/projection_notes.html][Notes]]

[[http://cogsci.yale.edu/sites/default/files/files/Thesis2017Banatt.pdf][Input Latency Detection in Expert-Level Gamers]]

[[file:articles/hitbox.html][Analog Button Gamecube Controller]]

[[file:articles/framerate.html]["Framerate" in Visual Perception]]

** Stats

[[file:articles/personainsmash.html][Predicting Personality with Playstyle in Super Smash Brothers]]

[[http://planetbanatt.net/articles/lagless.html][Delays Have Dangerous Ends: On Monitors in SSBM]]

[[http://planetbanatt.net/articles/ensembles.html][Invasion of the Ballot Snatchers (and Other Stories) - Decorrelated Errors in Panel-Based Rank Voting]]

[[https://planetbanatt.net/articles/ssbmrank2022.html][Notes on SSBMRank 2022]]

[[https://planetbanatt.net/articles/bluelock.html][Simulating the Blue Lock Second Selection]]

[[https://planetbanatt.net/articles/freewill.html][The "Free Will" Test]]

[[file:articles/omron.html][How Variable Are Omron Body Composition Scales?]]

[[file:articles/health.html][Optimizing Health with Cronometer]]

[[file:articles/potbonus.html][Do Pot Bonuses Affect Entrant Numbers at Melee Tournaments?]]

** Games

[[file:articles/humantheorytas.html][STARS ALIGNED - A Human Theory TAS Combo Video - Annotations]]

[[https://planetbanatt.net/articles/itl2023.html][ITL Online 2023 Retrospective]]

[[file:articles/celeste.html][Just Breathe. Celeste is Game of the Decade]]

[[file:articles/random20xx.html][20XX Randomized Savestates in Dolphin]]

[[file:articles/ambiGCC.html][Building a Better Gamecube Controller]]

[[file:articles/kadano_controller_review.html][Kadano Controller Review]]

[[http://planetbanatt.net/articles/lesson_notes.html][Melee Lesson Resources for Fox Players + Thoughts on Learning in Melee]]

[[https://planetbanatt.net/articles/dancegames.html][Dance Games: How I Learned to Stop Worrying and Love Cardio]]

[[https://planetbanatt.net/articles/contradictions.html][Melee Rankings are a Game of Contradictions]]

** Misc

[[https://planetbanatt.net/articles/memorycraft.html][Book Review: Memory Craft by Lynne Kelly]]

[[https://planetbanatt.net/articles/memory.html][Learning to Memorize, Cheating to Memorize Quickly]]

[[https://planetbanatt.net/articles/wangfeng.html][Wang Feng Lecture on Memory Techniques (Machine Translation)]]

[[https://planetbanatt.net/articles/paocards.html][Printing Custom PAO Playing Cards]]

[[https://planetbanatt.net/articles/square1.html][Trying to Solve a Square-1 with No Algorithms]]

[[file:articles/anki.html][Notes on Spaced Repetition]]

[[file:articles/pingpongzen.html][/Zen in the Art of Ping Pong The Animation/]]

[[https://planetbanatt.net/articles/coolness.html][Novelty Dispersion]]

[[http://planetbanatt.net/articles/content_thoughts.html][Guitars, Quizbowl, and Bad English Classes: On What Makes Content Good]]

[[file:articles/boredom.html][A Tale of Two Boredoms]]

[[https://planetbanatt.net/articles/parable.html][The Parable of the Monster]]

[[file:articles/360view.html][Seeing Everything: A Visual Perception Experiment Proposal]]

[[http://planetbanatt.net/articles/energydrink.html][Energy Drink Tier List]]
