index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-27 Wed 10:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Eryk Banatt</title>
<meta name="author" content="Eryk Banatt" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
<link  href="./css/index.css" rel="stylesheet">
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content" class="content">
<h1 class="title">Eryk Banatt</h1>
<div id="table-of-contents" role="doc-toc">
<h1>Table of Contents</h1>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6c51e65">Articles</a>
<ul>
<li><a href="#orgaa89ec7">Recent</a></li>
<li><a href="#org8b74d48">Projects</a></li>
<li><a href="#orge01bd7c">Stats</a></li>
<li><a href="#org9d507b8">Games</a></li>
<li><a href="#orgb3d6238">Misc</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org6c51e65" class="outline-1">
<h1 id="org6c51e65">Articles</h1>
<div class="outline-text-1" id="text-org6c51e65">
</div>
<div id="outline-container-orgaa89ec7" class="outline-2">
<h2 id="orgaa89ec7">Recent</h2>
<div class="outline-text-2" id="text-orgaa89ec7">
<p>
<a href="https://planetbanatt.net/articles/memory.html">Learning to Memorize, Cheating to Memorize Quickly</a>
</p>
</div>
</div>

<div id="outline-container-org8b74d48" class="outline-2">
<h2 id="org8b74d48">Projects</h2>
<div class="outline-text-2" id="text-org8b74d48">
<p>
<a href="https://planetbanatt.net/articles/lastdance.pdf">LASTDANCE: Layerwise Activation Similarity to Training Data for Assessing Non-Conforming Events (pre-preprint)</a> <a href="https://github.com/ambisinister/LASTDANCE/blob/master/LASTDANCE_README.ipynb">(Notebook)</a>
</p>

<p>
<a href="articles/ambistats.html">Making Sense of Melee: The Illusion of Objective Ranks and the Real Impact of Everything</a>
</p>

<p>
<a href="https://planetbanatt.net/articles/itsa17.html">Auto-Rating ITG Stamina Charts with Machine Learning</a>
</p>

<p>
<a href="https://planetbanatt.net/articles/Bracket_Stamina.pdf">Bracket Stamina: Inferring the Intent of Other Agents in a Multiplayer Kelly Coin Flip Game</a>
</p>

<p>
<a href="articles/visualdistance.html">Locating Visual Jokes in Homestuck Using Rudimentary Computer Vision</a>
</p>

<p>
<a href="articles/groundwork_for_projection_algorithm.html">Melee Bracket Projection Algorithm</a> - <a href="articles/projection_notes.html">Notes</a>
</p>

<p>
<a href="http://cogsci.yale.edu/sites/default/files/files/Thesis2017Banatt.pdf">Input Latency Detection in Expert-Level Gamers</a>
</p>

<p>
<a href="articles/hitbox.html">Analog Button Gamecube Controller</a>
</p>

<p>
<a href="articles/framerate.html">"Framerate" in Visual Perception</a>
</p>
</div>
</div>

<div id="outline-container-orge01bd7c" class="outline-2">
<h2 id="orge01bd7c">Stats</h2>
<div class="outline-text-2" id="text-orge01bd7c">
<p>
<a href="articles/personainsmash.html">Predicting Personality with Playstyle in Super Smash Brothers</a>
</p>

<p>
<a href="http://planetbanatt.net/articles/lagless.html">Delays Have Dangerous Ends: On Monitors in SSBM</a>
</p>

<p>
<a href="http://planetbanatt.net/articles/ensembles.html">Invasion of the Ballot Snatchers (and Other Stories) - Decorrelated Errors in Panel-Based Rank Voting</a>
</p>

<p>
<a href="https://planetbanatt.net/articles/ssbmrank2022.html">Notes on SSBMRank 2022</a>
</p>

<p>
<a href="https://planetbanatt.net/articles/bluelock.html">Simulating the Blue Lock Second Selection</a>
</p>

<p>
<a href="https://planetbanatt.net/articles/freewill.html">The "Free Will" Test</a>
</p>

<p>
<a href="articles/omron.html">How Variable Are Omron Body Composition Scales?</a>
</p>

<p>
<a href="articles/health.html">Optimizing Health with Cronometer</a>
</p>

<p>
<a href="articles/potbonus.html">Do Pot Bonuses Affect Entrant Numbers at Melee Tournaments?</a>
</p>
</div>
</div>

<div id="outline-container-org9d507b8" class="outline-2">
<h2 id="org9d507b8">Games</h2>
<div class="outline-text-2" id="text-org9d507b8">
<p>
<a href="articles/humantheorytas.html">STARS ALIGNED - A Human Theory TAS Combo Video - Annotations</a>
</p>

<p>
<a href="https://planetbanatt.net/articles/itl2023.html">ITL Online 2023 Retrospective</a>
</p>

<p>
<a href="articles/celeste.html">Just Breathe. Celeste is Game of the Decade</a>
</p>

<p>
<a href="articles/random20xx.html">20XX Randomized Savestates in Dolphin</a>
</p>

<p>
<a href="articles/ambiGCC.html">Building a Better Gamecube Controller</a>
</p>

<p>
<a href="articles/kadano_controller_review.html">Kadano Controller Review</a>
</p>

<p>
<a href="http://planetbanatt.net/articles/lesson_notes.html">Melee Lesson Resources for Fox Players + Thoughts on Learning in Melee</a>
</p>

<p>
<a href="https://planetbanatt.net/articles/dancegames.html">Dance Games: How I Learned to Stop Worrying and Love Cardio</a>
</p>

<p>
<a href="https://planetbanatt.net/articles/contradictions.html">Melee Rankings are a Game of Contradictions</a>
</p>
</div>
</div>

<div id="outline-container-orgb3d6238" class="outline-2">
<h2 id="orgb3d6238">Misc</h2>
<div class="outline-text-2" id="text-orgb3d6238">
<p>
<a href="https://planetbanatt.net/articles/memory.html">Learning to Memorize, Cheating to Memorize Quickly</a>
</p>

<p>
<a href="https://planetbanatt.net/articles/wangfeng.html">Wang Feng Lecture on Memory Techniques (Machine Translation)</a>
</p>

<p>
<a href="articles/anki.html">Notes on Spaced Repetition</a>
</p>

<p>
<a href="articles/pingpongzen.html"><i>Zen in the Art of Ping Pong The Animation</i></a>
</p>

<p>
<a href="https://planetbanatt.net/articles/coolness.html">Novelty Dispersion</a>
</p>

<p>
<a href="http://planetbanatt.net/articles/content_thoughts.html">Guitars, Quizbowl, and Bad English Classes: On What Makes Content Good</a>
</p>

<p>
<a href="articles/boredom.html">A Tale of Two Boredoms</a>
</p>

<p>
<a href="https://planetbanatt.net/articles/parable.html">The Parable of the Monster</a>
</p>

<p>
<a href="articles/360view.html">Seeing Everything: A Visual Perception Experiment Proposal</a>
</p>

<p>
<a href="http://planetbanatt.net/articles/energydrink.html">Energy Drink Tier List</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
<div id="comments">
    <p></p>
    <hr />
       <div id="disqus_thread">
           <script>
(function() {
var d = document, s = d.createElement('script');
s.src = 'https://planetbanatt.disqus.com/embed.js';
s.setAttribute('data-timestamp', +new Date());
(d.head || d.body).appendChild(s);
})();
</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
</div>
</div>
</body>
</html>
